server/app/controllers/api/v1/auth_controller.rb

      def create
        script = Script.find_by(cuid: params[:script][:cuid])
        if script.present? && script.authenticate(params[:script][:password])
          editor = script.editors.find_by(name: params[:editor][:name]) || Editor.create(editor_params)
---
SELECT  "scripts".* FROM "scripts" WHERE "scripts"."cuid" = $1 LIMIT $2  [["cuid", "cj5ir7vn800003i5rebrnzq60"], ["LIMIT", 1]]
INSERT INTO "editors" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "annee"], ["created_at", "2017-07-24 23:00:21.999312"], ["updated_at", "2017-07-24 23:00:21.999312"]]
SELECT  "editors".* FROM "editors" INNER JOIN "editor_versions" ON "editors"."id" = "editor_versions"."editor_id" INNER JOIN "versions" ON "editor_versions"."version_id" = "versions"."id" WHERE "versions"."script_id" = $1 AND "editors"."name" = $2 ORDER BY "versions"."created_at" DESC LIMIT $3  [["script_id", 3], ["name", "annee"], ["LIMIT", 1]]