server/app/controllers/api/v1/scripts_controller.rb

      def show
        script = Script.find_by(cuid: params[:id])
---
SELECT  "scripts".* FROM "scripts" WHERE "scripts"."cuid" = $1 LIMIT $2  [["cuid", "cj5iqg6un00003i5r48mym30k"], ["LIMIT", 1]]