server/app/controllers/api/v1/versions_controller.rb

      def create
        version = Version.new(version_params)
        if version.save
---
INSERT INTO "versions" ("script_id", "contentState", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"